Tekla Open API Reference for Tekla Structures 2025
AnalysisModelOutputProperties.OutputElementJointStressesSolid Property
 Indicates whether the element joint stresses solid is created.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool OutputElementJointStressesSolid { get; set; }
Public Property OutputElementJointStressesSolid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisModelOutputProperties Class
Tekla.Structures.Analysis Namespace